tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Distributed revision control system
brew "git"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Optimizes Matroska and WebM files
brew "mkclean"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Bundler for JavaScript and friends
brew "webpack"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# GTK+ based wave viewer
cask "gtkwave"
# Command-line shell and scripting language
cask "powershell"
# Open-source version of the X.Org X Window System
cask "xquartz"
